# EASY

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.


# Решение задачи-1
x = 6542234
x = str(x)

i = 0
while i < len(x):
    print(x[i])
    i += 1


# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную
# или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!


# Решение задачи-2
temp = None
x = input("Введите значение X:")
y = input("Введите значение Y:")

temp = x
x = y
y = temp
print(f"Меняем значения переменных, получаем: X - {x} и Y - {y}")


# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"


# Решение задачи-3
year = int(input("Введите ваш возраст:"))
if year >= 18:
    print("Доступ разрешен")
else:
    print("Извините, пользование данным ресурсом только с 18 лет")


# NORMAL
# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.


# Решение задачи-1
x = 58375
x = tuple(str(x))
print(max(x))

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.
# a = input("Input a: ")
# b = input("Input b: ")
# a,b = b,a


# Решение задачи-2
x = input("Введите значение X:")
y = input("Введите значение Y:")

x, y = y, x

print(f"Меняем значения переменных, получаем: X - {x} и Y - {y}")

# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4


# Решение задачи-3
import math

x1 = x2 = 0.0

a = float(input("Введите коэфицент A:"))
b = float(input("Введите коэфицент B:"))
c = float(input("Введите коэфицент C:"))

d = (b * b) - (4 * a * c)
if d == 0:
    x1 = (-b + math.sqrt(d)) / (2 * a)
    x2 = (-b - math.sqrt(d)) / (2 * a)
    print("Уравнение имеет единственный корень")
    print(x1)
    print(x2)
elif d > 0:
    x1 = (-b + math.sqrt(d)) / (2 * a)
    x2 = (-b - math.sqrt(d)) / (2 * a)
    print("Уравнение имеет 2 различных корня")
    print(x1)
    print(x2)
elif d < 0:
    print("Уравнение не имеет корней")

# HARD
# Задание-1:
# Пользователь вводит число определите, является ли данное число простым. Делится только на себя и на единицу

# Решение задачи-1
x = int(input("Введите число: "))
check = all(x % i for i in range(2, x))

if check:
    print("Число простое")
else:
    print("Число непростое")


# Задание-2
# Найдите n-ое число Фибоначчи

# Решение задачи-2

# # 1-й вариант

def fibo(n):
    if n == 1 or n == 2:
        return 1
    else:
        return fibo(n - 1) + fibo(n - 2)


number = int(input("Какое число в последовательности Фибоначчи нам найти: "))
result = fibo(number)
print(f"Число Фибоначчи: {result}")

# # или 2-й вариант

x = 1
y = 1

number = int(input("Какое число в последовательности Фибоначчи нам найти: "))

for i in range(2, number):
    y = x + y
    x = y - x

print(f"Число Фибоначчи: {y}")

# Задание-3
# Вывести на экран:
# AAABBBAAABBBAAABBB
# BBBAAABBBAAABBBAAA
# AAABBBAAABBBAAABBB
# (таких строк n, в каждой строке m троек AAA)

# Решение задачи-3
n = int(input("Введите количество строк: "))
m = int(input("Введите количество троек ААА: "))

for i in range(0, n):
    print("AAABBB" * m)